// 1) დაწერეთ ფუნცქია რომელიც დალოგავს მაუსის კოორდინატებს მხოლოდ მას შემდეგ რაც მაუსი გაჩერდება,
//  გამოიყენეთ debaunce ტექნიკა. მინიშნება: window.addEventListener('mousemove',(e) => {
//     console.log(e.clientX, e.clientY)
// })

// 2) შექმენით html-ში ბათონი და ყოველ ბათონის ქლიქზე დაარექუესთეთ შემდეგი API-დან და მიღებული 
// შედეგი გამოაჩნიეთ https://dummyjson.com/quotes ისევე როგორც რენდომ კატის ფაქტზე ვქენით.

// 3) დაწერეთ ფუნცქია რომელიც წამოიღებს იუზერების ინფორმაციას შემდეგი API-დან 
// https://dummyjson.com/users თქვენი მიზანია გააკეთოთ ფეჯინეიშენი სულ არის 200-ზე 
// მეტი იუზერი და დიფოტად მოდის 30. მინიშნება, თუ სრულ რაოდენობას გაყოფთ ლიმიტზე 
// მიიღებთ ფეიჯების რაოდენობას, რაც შეეხება როგორ უნდა გამოთვალოთ skip ფროფერთი.
//  skip = (page - 1) * limit) limit = 30

// 4) შექმენით ინფუთი სადაც იუზერი მხოლოდ რიცხვებს შეიყვანს, რიცხვის შეყვანის
//  შემდეგ უნდა დაარექუესთოთ შემდეგ ეიპიაიზე https://myfakeapi.com/api/cars/10 10-ის 
// ნაცვლად ჩაწერეთ იუზერის შეყვანილი ინფომრაცია, ეს ეიპიაი დაგიბრუნებთ მანქანის 
// ინფორმაციას და გამოაჩინეტ ეს ინფორმაცია დომში. ასევე თუ არასწორი აიდი დაწერა 
// მაგალითად 9999 ბექენდი დაგირტყავთ ერორს და გაჰენდლეთ ერორი და უთხარით
// იუზერს რომ სწორი აიდი შეიყვანოს, მაგალითად alert ის გამოყენებით.